
from typing import Union, Optional
from FN015.models.trie.char_node import CharNode
import unicodedata

hiragana_map = {
    'ｶﾞ': 'け', 'ｷﾞ': 'ぎ', 'ｸﾞ': 'ぐ', 'ｹﾞ': 'け', 'ｺﾞ': 'ご',
    'ｻﾞ': 'ざ', 'ｼﾞ': 'じ', 'ｽﾞ': 'ず', 'ｾﾞ': 'ぜ', 'ｿﾞ': 'ぞ',
    'ﾀﾞ': 'だ', 'ﾁﾞ': 'ぢ', 'ﾂﾞ': 'づ', 'ﾃﾞ': 'で', 'ﾄﾞ': 'ど',
    'ﾊﾞ': 'ば', 'ﾋﾞ': 'び', 'ﾌﾞ': 'ぶ', 'ﾍﾞ': 'べ', 'ﾎﾞ': 'ぼ',
    'ﾊﾟ': 'ぱ', 'ﾋﾟ': 'ぴ', 'ﾌﾟ': 'ぷ', 'ﾍﾟ': 'ぺ', 'ﾎﾟ': 'ぽ',
    'ｳﾞ': 'ゔ', 'ﾜﾞ': 'ゔぁ', 'ｦﾞ': 'ゔぉ',
    'ｱ': 'あ', 'ｲ': 'い', 'ｳ': 'う', 'ｴ': 'え', 'ｵ': 'お',
    'ｶ': 'け', 'ｷ': 'き', 'ｸ': 'く', 'ｹ': 'け', 'ｺ': 'こ',
    'ｻ': 'さ', 'ｼ': 'し', 'ｽ': 'す', 'ｾ': 'せ', 'ｿ': 'そ',
    'ﾀ': 'た', 'ﾁ': 'ち', 'ﾂ': 'つ', 'ﾃ': 'て', 'ﾄ': 'と',
    'ﾅ': 'な', 'ﾆ': 'に', 'ﾇ': 'ぬ', 'ﾈ': 'ね', 'ﾉ': 'の',
    'ﾊ': 'は', 'ﾋ': 'ひ', 'ﾌ': 'ふ', 'ﾍ': 'へ', 'ﾎ': 'ほ',
    'ﾏ': 'ま', 'ﾐ': 'み', 'ﾑ': 'む', 'ﾒ': 'め', 'ﾓ': 'も',
    'ﾔ': 'や', 'ﾕ': 'ゆ', 'ﾖ': 'よ', 'ﾗ': 'ら', 'ﾘ': 'り', 'ﾙ': 'る', 'ﾚ': 'れ', 'ﾛ': 'ろ',
    'ﾜ': 'わ', 'ｦ': 'を', 'ﾝ': 'ん', 'ｧ': 'あ', 'ｨ': 'い', 'ｩ': 'う', 'ｪ': 'え', 'ｫ': 'お',
    'ｯ': 'つ', 'ｬ': 'や', 'ｭ': 'ゆ', 'ｮ': 'よ',
    'ガ': 'け', 'が': 'け', 'ギ': 'ぎ', 'グ': 'ぐ', 'ゲ': 'け', 'げ': 'け', 'ゴ': 'ご',
    'ザ': 'ざ', 'ジ': 'じ', 'ズ': 'ず', 'ゼ': 'ぜ', 'ゾ': 'ぞ', 'ダ': 'だ', 'ヂ': 'ぢ', 'ヅ': 'づ',
    'デ': 'で', 'ド': 'ど', 'バ': 'ば', 'ビ': 'び', 'ブ': 'ぶ', 'ベ': 'べ', 'ボ': 'ぼ',
    'パ': 'ぱ', 'ピ': 'ぴ', 'プ': 'ぷ', 'ペ': 'ぺ', 'ポ': 'ぽ', 'ヴ': 'ゔ', 'ヷ': 'ゔぁ', 'ヺ': 'ゔぉ',
    'ぁ': 'あ', 'ァ': 'あ', 'ア': 'あ', 'ぃ': 'い', 'ィ': 'い', 'イ': 'い', 'ぅ': 'う', 'ゥ': 'う', 'ウ': 'う',
    'ぇ': 'え', 'ェ': 'え', 'ヱ': 'え', 'ゑ': 'え', 'エ': 'え', 'オ': 'お', 'ぉ': 'お', 'ォ': 'お',
    'ゕ': 'け', 'ヵ': 'け', 'カ': 'け', 'キ': 'き', 'ク': 'く', 'ㇰ': 'く', 'ケ': 'け', 'ヶ': 'け', 'ゖ': 'け',
    'コ': 'こ', 'サ': 'さ', 'シ': 'し', 'ㇱ': 'し', 'ス': 'す', 'ㇲ': 'す', 'セ': 'せ', 'ソ': 'そ', 'タ': 'た',
    'チ': 'ち', 'ツ': 'つ', 'っ': 'つ', 'ッ': 'つ', 'テ': 'て', 'ト': 'と', 'ㇳ': 'と', 'ナ': 'な', 'ニ': 'に',
    'ヌ': 'ぬ', 'ㇴ': 'ぬ', 'ネ': 'ね', 'ノ': 'の', '丿': 'の', 'ハ': 'は', 'ㇵ': 'は', 'ヒ': 'ひ', 'ㇶ': 'ひ',
    'フ': 'ふ', 'ㇷ': 'ふ', 'ヘ': 'へ', 'ㇸ': 'へ', 'ホ': 'ほ', 'ㇹ': 'ほ', 'マ': 'ま', 'ミ': 'み', 'ム': 'む',
    'ㇺ': 'む', 'メ': 'め', 'モ': 'も', 'ヤ': 'や', 'ゃ': 'や', 'ャ': 'や', 'ユ': 'ゆ', 'ゅ': 'ゆ', 'ュ': 'ゆ',
    'ヨ': 'よ', 'ょ': 'よ', 'ョ': 'よ', 'ラ': 'ら', 'ㇻ': 'ら', 'リ': 'り', 'ㇼ': 'り', 'ル': 'る', 'ㇽ': 'る',
    'レ': 'れ', 'ㇾ': 'れ', 'ロ': 'ろ', 'ㇿ': 'ろ', 'ゎ': 'わ', 'ワ': 'わ', 'ヮ': 'わ', 'ヲ': 'を', 'ン': 'ん', '之': 'の',
}

def to_hiragana(target: Union[str, CharNode, None]) -> Union[str, CharNode, None]:
    if target is None:
        return None
    if isinstance(target, str):
        # Unicode NFKC normalization (convert half-width to full-width, etc.)
        normalized = unicodedata.normalize('NFKC', target)
        return ''.join([hiragana_map.get(c, c) for c in normalized])
    if isinstance(target, CharNode):
        return to_hiragana_for_char_node(target)
    raise TypeError('unsupported value type')

def to_hiragana_for_char_node(target: Optional[CharNode]) -> Optional[CharNode]:
    head = target
    while head:
        if head.char:
            head.char = hiragana_map.get(head.char, head.char)
        head = head.next
    return target 