
from typing import Union, Optional
from FN015.models.trie.char_node import CharNode

katakana_map = {
    'ｶﾞ': 'ガ', 'ｷﾞ': 'ギ', 'ｸﾞ': 'グ', 'ｹﾞ': 'ゲ', 'ｺﾞ': 'ゴ',
    'ｻﾞ': 'ザ', 'ｼﾞ': 'ジ', 'ｽﾞ': 'ズ', 'ｾﾞ': 'ゼ', 'ｿﾞ': 'ゾ',
    'ﾀﾞ': 'ダ', 'ﾁﾞ': 'ヂ', 'ﾂﾞ': 'ヅ', 'ﾃﾞ': 'デ', 'ﾄﾞ': 'ド',
    'ﾊﾞ': 'バ', 'ﾋﾞ': 'ビ', 'ﾌﾞ': 'ブ', 'ﾍﾞ': 'ベ', 'ﾎﾞ': 'ボ',
    'ﾊﾟ': 'パ', 'ﾋﾟ': 'ピ', 'ﾌﾟ': 'プ', 'ﾍﾟ': 'ペ', 'ﾎﾟ': 'ポ',
    'ｳﾞ': 'ヴ', 'ﾜﾞ': 'ヴ', 'ｦﾞ': 'ヲ',
    'ｱ': 'ア', 'ｲ': 'イ', 'ｳ': 'ウ', 'ｴ': 'エ', 'ｵ': 'オ',
    'ｶ': 'カ', 'ｷ': 'キ', 'ｸ': 'ク', 'ｹ': 'ケ', 'ｺ': 'コ',
    'ｻ': 'サ', 'ｼ': 'シ', 'ｽ': 'ス', 'ｾ': 'セ', 'ｿ': 'ソ',
    'ﾀ': 'タ', 'ﾁ': 'チ', 'ﾂ': 'ツ', 'ﾃ': 'テ', 'ﾄ': 'ト',
    'ﾅ': 'ナ', 'ﾆ': 'ニ', 'ﾇ': 'ヌ', 'ﾈ': 'ネ', 'ﾉ': 'ノ',
    'ﾊ': 'ハ', 'ﾋ': 'ヒ', 'ﾌ': 'フ', 'ﾍ': 'ヘ', 'ﾎ': 'ホ',
    'ﾏ': 'マ', 'ﾐ': 'ミ', 'ﾑ': 'ム', 'ﾒ': 'メ', 'ﾓ': 'モ',
    'ﾔ': 'ヤ', 'ﾕ': 'ユ', 'ﾖ': 'ヨ', 'ﾗ': 'ラ', 'ﾘ': 'リ', 'ﾙ': 'ル', 'ﾚ': 'レ', 'ﾛ': 'ロ',
    'ﾜ': 'ワ', 'ｦ': 'ヲ', 'ﾝ': 'ン', 'ｧ': 'ア', 'ｨ': 'イ', 'ｩ': 'ウ', 'ｪ': 'エ', 'ｫ': 'オ',
    'ｯ': 'ツ', 'ｬ': 'ヤ', 'ｭ': 'ユ', 'ｮ': 'ヨ',
    'ガ': 'ガ', 'ギ': 'ギ', 'グ': 'グ', 'ゲ': 'ゲ', 'ゴ': 'ゴ',
    'ザ': 'ザ', 'ジ': 'ジ', 'ズ': 'ズ', 'ゼ': 'ゼ', 'ゾ': 'ゾ', 'ダ': 'ダ', 'ヂ': 'ヂ', 'ヅ': 'ヅ',
    'デ': 'デ', 'ド': 'ド', 'バ': 'バ', 'ビ': 'ビ', 'ブ': 'ブ', 'ベ': 'ベ', 'ボ': 'ボ',
    'パ': 'パ', 'ピ': 'ピ', 'プ': 'プ', 'ペ': 'ペ', 'ポ': 'ポ', 'ヴ': 'ヴ', 'ヷ': 'ヴ', 'ヺ': 'ヲ',
    'ぁ': 'ア', 'ァ': 'ア', 'ア': 'ア', 'ぃ': 'イ', 'ィ': 'イ', 'イ': 'イ', 'ぅ': 'ウ', 'ゥ': 'ウ', 'ウ': 'ウ',
    'ぇ': 'エ', 'ェ': 'エ', 'ヱ': 'エ', 'ゑ': 'エ', 'エ': 'エ', 'オ': 'オ', 'ぉ': 'オ', 'ォ': 'オ',
    'ゕ': 'カ', 'ヵ': 'カ', 'カ': 'カ', 'キ': 'キ', 'ク': 'ク', 'ㇰ': 'ク', 'ケ': 'ガ', 'ヶ': 'ガ', 'ゖ': 'ガ',
    'コ': 'コ', 'サ': 'サ', 'シ': 'シ', 'ㇱ': 'シ', 'ス': 'ス', 'ㇲ': 'ス', 'セ': 'セ', 'ソ': 'ソ', 'タ': 'タ',
    'チ': 'チ', 'ツ': 'ツ', 'っ': 'ツ', 'ッ': 'ツ', 'テ': 'テ', 'ト': 'ト', 'ㇳ': 'ト', 'ナ': 'ナ', 'ニ': 'ニ',
    'ヌ': 'ヌ', 'ㇴ': 'ヌ', 'ネ': 'ネ', 'ノ': 'ノ', '丿': 'ノ', 'ハ': 'ハ', 'ㇵ': 'ハ', 'ヒ': 'ヒ', 'ㇶ': 'ヒ',
    'フ': 'フ', 'ㇷ': 'フ', 'ヘ': 'ヘ', 'ㇸ': 'ヘ', 'ホ': 'ホ', 'ㇹ': 'ホ', 'マ': 'マ', 'ミ': 'ミ', 'ム': 'ム',
    'ㇺ': 'ム', 'メ': 'メ', 'モ': 'モ', 'ヤ': 'ヤ', 'ゃ': 'ヤ', 'ャ': 'ヤ', 'ユ': 'ユ', 'ゅ': 'ユ', 'ュ': 'ユ',
    'ヨ': 'ヨ', 'ょ': 'ヨ', 'ョ': 'ヨ', 'ラ': 'ラ', 'ㇻ': 'ラ', 'リ': 'リ', 'ㇼ': 'リ', 'ル': 'ル', 'ㇽ': 'ル',
    'レ': 'レ', 'ㇾ': 'レ', 'ロ': 'ロ', 'ㇿ': 'ロ', 'ゎ': 'ワ', 'ワ': 'ワ', 'ヮ': 'ワ', 'ヲ': 'ヲ', 'ン': 'ン', '之': 'ノ',
}

def to_katakana(target: Union[str, CharNode, None]) -> Union[str, CharNode, None]:
    if target is None:
        return None
    if isinstance(target, str):
        return ''.join([katakana_map.get(c, c) for c in target])
    if isinstance(target, CharNode):
        return to_katakana_for_char_node(target)
    raise TypeError('unsupported value type')

def to_katakana_for_char_node(target: Optional[CharNode]) -> Optional[CharNode]:
    head = target
    while head:
        if head.char:
            head.char = katakana_map.get(head.char, head.char)
        head = head.next
    return target 